app/controllers/similar_artists_controller.rb

INSERT INTO "similar_artists" ("name") VALUES ($1) RETURNING "id"
---
	def create
		@similar = SimilarArtist.new(similar_params)
		if @similar.save

SELECT  "similar_artists".* FROM "similar_artists"  WHERE "similar_artists"."id" = $1 LIMIT 1
---
	def show
		@similar = SimilarArtist.find(params[:id])